# RepeatingDetailElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RepeatingDetailElement Property
ParameterTypeId Class See Also
---
"Detail"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RepeatingDetailElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RepeatingDetailElement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RepeatingDetailElement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace